{"reviewerID": "AO94DHGC771SJ", "asin": "0528881469", "reviewerName": "amazdnu", "helpful": [0, 0], "reviewText": "We got this GPS for my husband who is an (OTR) over the road trucker.  Very Impressed with the shipping time, it arrived a few days earlier than expected...  within a week of use however it started freezing up... could of just been a glitch in that unit.  Worked great when it worked!  Will work great for the normal person as well but does have the \"trucker\" option. (the big truck routes - tells you when a scale is coming up ect...)  Love the bigger screen, the ease of use, the ease of putting addresses into memory.  Nothing really bad to say about the unit with the exception of it freezing which is probably one in a million and that's just my luck.  I contacted the seller and within minutes of my email I received a email back with instructions for an exchange! VERY impressed all the way around!", "overall": 5.0, "summary": "Gotta have GPS!", "unixReviewTime": 1370131200, "reviewTime": "06 2, 2013"}
{"reviewerID": "AMO214LNFCEI4", "asin": "0528881469", "reviewerName": "Amazon Customer", "helpful": [12, 15], "reviewText": "I'm a professional OTR truck driver, and I bought a TND 700 at a truck stop hoping to make my life easier.  Rand McNally, are you listening?First thing I did after charging it was connect it to my laptop and install the software and then attempt to update it.  The software detected a problem with my update and wanted my home address so I could be sent a patch on an SD card.  Hello?  I don't think I'm all that unusual; my home address is a PO box that a friend checks weekly and that I might get to check every six months or so.  I live in my truck and at truck stops.  If you need to make a patch available on an SD card then you should send the SD cards to the truck stops where the devices are sold.  I ran the update program multiple times until the program said that the TND 700 was completely updated.I programmed in the height (13'6\"), the length (53') and the weight (80,000#) of my rig and told it that I preferred highways.  I was parked at a truck stop in the Cincinnati OH area.  My next pickup was about 15 miles down the same freeway but on the other side of it a couple of blocks.  My cell phone GPS (Sprint) said to get on the freeway to get to my pickup.  The TND 700 routed me thru 23 miles of residential streets before finally getting me to my pickup.  Very exciting, especially since every time I refused to turn down a street posted \"No Trucks\" the TND 700 took almost 5 minutes to figure a re-route, and it happened multiple times on that short trip.I decided to give it another chance.  After my pickup on the north side of Cincinnati just off of I-75 I needed to head to Phoenix AZ via I-71.  Easy route is to just hop on I-75 and drive west and south to the intersection of I-71.  Indeed, that is what my cell phone advised.  The TND 700, however, wanted to route me over surface streets across the city and pick up I-75 on the other side of the city.  I turned it off and the next time I passed a truck stop of the same chain I purchased it at I returned it and got my money back.I then spent $30 on a cheap printer.  Now I take a minute to set up my route on Google and print it out.  Hasn't gotten me lost yet over several cross country trips.", "overall": 1.0, "summary": "Very Disappointed", "unixReviewTime": 1290643200, "reviewTime": "11 25, 2010"}
{"reviewerID": "A3N7T0DY83Y4IG", "asin": "0528881469", "reviewerName": "C. A. Freeman", "helpful": [43, 45], "reviewText": "Well, what can I say.  I've had this unit in my truck for about four days now.  Prior to that I had a Garmin 755T non-truck GPS.  One of my favorite features in that unit was the ability to plan a route by determining mileage using the stop or via feature.  What I would do is using a map I would route myself several different ways forcing the unit by putting in stops or vias at different locations along the route, otherwise, like most GPS 's, it determines what it thinks is the best route.  I could add up to 10 Via's or stop points for each route and then based on mileage and other factors determine which is the best route to take.  Multiple stops and the ability to route was the most important reason for having the Garmin.  However it was not truck specific.  And considering I am now hauling strictly hazmat I wanted something that would take that into consideration.  After perusing various forums, review sites, and word-of-mouth my choices boiled down to the Garmin 465T or the RAND McNally Intelliroute TND 700.  Even though it was quite a bit more than the Garmin I chose the TND 700 for several reasons.  The main one being the extra screen size, and its ability to coordinate with the RAND McNally truck atlas and also its ease of updating.Now on to my first impression of the TND 700.  It seems to be an aesthetically pleasing and durably built unit.  The first thing I noticed was it's very slow to boot compared to my old Garmin.  Whether this is unique to the TND 700 or is common amongst all truck specific gps units I cannot tell, but it's really not that big of a deal.  The second thing I noticed was the overwhelming wealth of information put forth.  That might explain why the manual (available via the TND dock) is well over 100 pages long.....  There is somewhat of a learning curve with this unit.  The next thing I noticed was the complexity of entering routes.  As previously mentioned I like to force it into my preferred routing by the use of stops or vias.  That was a big no go with this unit.  While you can enter multiple stops or vias it is nowhere near as user-friendly as my old Garmin.  Furthermore there is no way you can determine total mileage on the route that you have chosen, as I could with the Garmin.  Totally flummoxed by what appeared to be an omission of one of the best routing tools a trucker could have I went online and verified through an expert source connected with RAND McNally that no, that feature was a couple updates down the line and was not available at this point.  Unbelievable.  Also forcing the unit to follow a specific route can be very challenging.  For a unit of this price, and feature laden, I find this totally unacceptable.  I am still mulling over selling this unit  and buying the Garmin 465T.  I really do like this GPS, the screen is magnificent, and the volume is awesome.Another thing I've noticed, which I do not think is unique to this unit, is some of the weird routing that it does.  I've never owned a truck specific GPS before but after playing with this one for a couple of days I get the impression that what RAND MacNally (and the others that use Navteq) has done is take a plain old car specific Navteq map and a road atlas with truck restrictions and made notifications on the map.  In most databases there is not a 100% thorough listing of every road in the country.  What I mean is that this unit will route you down roads you don't belong on.  Today while coming home it tried routing me on several  9 ton County roads.  What that means is that a truck is limited to 73280 unless the road is posted at 10 tons.  County roads do not have that restriction listed in the RAND McNally road atlas, so I believe that is why it is not listed.....  Also unacceptable in a unit of this price and sold as truck specific.  However I'd be willing to bet the other truck specific units are the same way as no one has ever done a truck specific version of NavTeq.Another bone I have to pick is the POI's. Not only the truck specific ones but the others all seem to be somewhat outdated.  I think the Garmin, at least the ones that I have used, are more current.  It would also be nice if I could add my own POI'sTo sum it up I will keep this unit a little longer to see if I can make it workable.  If not I will go back to Garmin.  I like the concept and I like the unit but at this point I'll have to say I am somewhat unimpressed.pros:Large screenterrific imagesoutstanding volumecons:inability to determine route mileage by multiple stops and viasa somewhat outdated POI information.Non-truck specific routings.Cost.", "overall": 3.0, "summary": "1st impression", "unixReviewTime": 1283990400, "reviewTime": "09 9, 2010"}
{"reviewerID": "A1H8PY3QHMQQA0", "asin": "0528881469", "reviewerName": "Dave M. Shaw \"mack dave\"", "helpful": [9, 10], "reviewText": "Not going to write a long review, even thought this unit deserves one. I've driven well over 1-mil miles and done most of my own routing so I pretty know whats the fastest and shortest. Have been using a basic garmin for the past three years and with ANY Gps unit they'll ALL get you in trouble if you let them. I was really excited about this unit, due to the size and the features. Allot of great grafics and on screen info thats usefull. But the most basic item that it was lacking was the gps tracking. I gave this unit allot of leadway on its mistakes due to the fact that it had allot of cool stuff that it did, but its ability to track you and route you was not even close to what the basic garmin could due. Its like the prossesor that they installed in the TND 700 was 10 years old. Example if I needed to make a simple route change I.E. in town down to the next street due to the fact that I couldn't make the turn or the street was blocked off, it would take the TND 700 upwards of 45 seconds to a minute and a half to reroute me. Here I'm sitting at a stop light waiting for directions and waiting that long with cars on my backside didn't make me happy. This is a problem that happened evertime you had to reroute, weather it was a simple street change or a major highway change. Also from the time you turned the unit on it would take twice as long to boot itself up. At least a dozen times with in a week it put me on the wrong roads and when I made a wrong turn it got it self lost....I.E. take left on xyz street, and it was some ones drive way. Or turn left in 800 yards and the turn was less than 10 feet away. You might think in a conjested city situation I might get a little mixed up, but this is out in the country. Twice it put me under 12'6\" bridges when I'm 13'6\". Of course I made sure all my truck setting where they were supposed to be. I also updated the OS version,via Rand McNally. All in all I expected alot out of this unit and got a unit that should of been field tested with some people that drive allot. It just had to many route mistakes. Going back to the basic garmin. This isn't just my complaints, I have three friends that bought the same unit and have the same complaints. All of us returned the units.", "overall": 2.0, "summary": "Great grafics, POOR GPS", "unixReviewTime": 1290556800, "reviewTime": "11 24, 2010"}
{"reviewerID": "A24EV6RXELQZ63", "asin": "0528881469", "reviewerName": "Wayne Smith", "helpful": [0, 0], "reviewText": "I've had mine for a year and here's what we got. It tries to route be down non truck routes while telling me the truck route is illegal for me. This is such a bad problem that even Interstate 25 in Denver Colorado is listed (according to this GPS) as a non- truck route and will route you through the city instead. There are several drivers within our company who own one and more than half (of about 50) have crashed to an un-recoverable state. Our company representative said that Rand McNally informed them that the GPS was not designed to say on for a long period of time. Really? it's a truck driver GPS. We have one driver with a $2400 dollar ticket due to this GPS routing him down the wrong road. The companies response was to update the unit. I've had mine for a year, I never noticed one update that corrected functionality, they only seem to keep messing the tools. I want a GPS that routes, if I wanted tools I'd buy software for my computer.My suggestion is to by a nice Garmen. My one rated for cars actually routes me better than this one rated for trucks.Wayne", "overall": 1.0, "summary": "Major issues, only excuses for support", "unixReviewTime": 1317254400, "reviewTime": "09 29, 2011"}
{"reviewerID": "A2JXAZZI9PHK9Z", "asin": "0594451647", "reviewerName": "Billy G. Noland \"Bill Noland\"", "helpful": [3, 3], "reviewText": "I am using this with a Nook HD+. It works as described. The HD picture on my Samsung 52&#34; TV is excellent.", "overall": 5.0, "summary": "HDMI Nook adapter cable", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
{"reviewerID": "A2P5U7BDKKT7FW", "asin": "0594451647", "reviewerName": "Christian", "helpful": [0, 0], "reviewText": "The cable is very wobbly and sometimes disconnects itself.The price is completely unfair and only works with the Nook HD and HD+", "overall": 2.0, "summary": "Cheap proprietary scam", "unixReviewTime": 1398556800, "reviewTime": "04 27, 2014"}
{"reviewerID": "AAZ084UMH8VZ2", "asin": "0594451647", "reviewerName": "D. L. Brown \"A Knower Of Good Things\"", "helpful": [0, 0], "reviewText": "This adaptor is real easy to setup and use right out of the box. I had not problem with it at all, it is well worth the purchase. I recommend this adaptor very much for viewing your Nook videos on your HDTV. I just disagree with other reviews on the length of the adaptor, I found it to be fairly adequate as to how and where it is connected to my TV. For me it was just right not too long or too short, I was able to place my Nook right below the connection on the TV stand, it did not fall or anything else, it is fine. Use your own judgement, I'm too busy watching my movies :)", "overall": 5.0, "summary": "A Perfdect Nook HD+ hook up", "unixReviewTime": 1399161600, "reviewTime": "05 4, 2014"}
{"reviewerID": "AEZ3CR6BKIROJ", "asin": "0594451647", "reviewerName": "Mark Dietter", "helpful": [0, 0], "reviewText": "This adapter easily connects my Nook HD 7&#34; to my HDTV through the HDMI cable.  This is good for traveling because it makes any hotel TV a potential smart TV so long as there is an accessible HDMI port.  It is also good for sharing photos from FB on a bigger screen. A bit pricey, but a good accessory to have.  Be sure to note that this is ONLY for the Nook HD and HD+ series.  It will not work with a standard Nook.", "overall": 4.0, "summary": "A nice easy to use accessory.", "unixReviewTime": 1405036800, "reviewTime": "07 11, 2014"}
{"reviewerID": "A3BY5KCNQZXV5U", "asin": "0594451647", "reviewerName": "Matenai", "helpful": [3, 3], "reviewText": "This product really works great but I found the following items you need to keep in mind:- You must have your power adapter connected for it to work...it plugs in the the bottom. It appears it needs power from the nook power adapter to operate.- The plug fits in loosely and you cannot move the Nook around much without holding the adapter in place.- On initial plugin it seems you need to rock it around to get the connection but then it seems solid.- It works with a 25ft high quality HDMI cable so you can put the NOOK across the room with you. Not tested with cheap cables.Warning...I found that my LG SmartTV 3D from a few years back does not work with this adapter but it does not seem to work with many things...bad software. This adapter works fine with other HDMI devices I have used like monitors and I am sure other TVs.Gave it five stars because it really is nice to extend the screen and use your Nook as a streaming server to your TV. Nice they made such a device.", "overall": 5.0, "summary": "This works great but read the details...", "unixReviewTime": 1390176000, "reviewTime": "01 20, 2014"}
{"reviewerID": "A7S2B0I67WNWB", "asin": "0594481813", "reviewerName": "AllyMG", "helpful": [2, 2], "reviewText": "This item is just as was described in the original description, works without any issues to be seen. Good product", "overall": 4.0, "summary": "As expected", "unixReviewTime": 1397606400, "reviewTime": "04 16, 2014"}
{"reviewerID": "A3HICVLF4PFFMN", "asin": "0594481813", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "bought for a spare for my 9&#34; Nook HD and it fit perfectly.  Very satisfied with the price much less than on the BN site", "overall": 5.0, "summary": "great fit", "unixReviewTime": 1399248000, "reviewTime": "05 5, 2014"}
{"reviewerID": "ANSKSPEEAKY7S", "asin": "0594481813", "reviewerName": "Gena", "helpful": [1, 1], "reviewText": "My son crewed my HD charger cord so I needed another one, this is exactly like the one my son destroyed.", "overall": 5.0, "summary": "Works Great", "unixReviewTime": 1372032000, "reviewTime": "06 24, 2013"}
{"reviewerID": "A2QBZA4S1ROX9Q", "asin": "0594481813", "reviewerName": "Jake", "helpful": [0, 1], "reviewText": "This is a good beefy 2 amp charger, but it covers two outlets on a power strip. It's ok in a regular wall outlet. The best thing is it uses a standard USB connector so it can charge more than just a Nook (I have a Kindle Fire HD+).", "overall": 3.0, "summary": "It Works", "unixReviewTime": 1369440000, "reviewTime": "05 25, 2013"}
{"reviewerID": "ANY6JUFM0GH8U", "asin": "0594481813", "reviewerName": "J. Clement", "helpful": [2, 2], "reviewText": "I lost my B&N original cable.  I looked around for an new one.  I tried  a different, cheaper model but it didn't fit my device properly so back to the drawing board.  I ordered this one.  I am satisfied.  It works exactly as expected and fits perfectly.  I would recommend this product to anyone looking for a spare or in lieu of the original usb cable adapter.", "overall": 5.0, "summary": "Great replacement for original power cable", "unixReviewTime": 1394323200, "reviewTime": "03 9, 2014"}
{"reviewerID": "AT09WGFUM934H", "asin": "0594481813", "reviewerName": "John", "helpful": [0, 0], "reviewText": "It does 2A and charges a DEAD Nook in a few hours. It does so with a LOT of heat, compared to most wall worts. I have a dual charger where 1 port is 2.1A and the other is 1A for total output of 3.1A that doesn't run as hot as this. And i use that to power a raspberry pi to avoid needing a powered hubIt does the job adequately as it's designed to. Just hot. I would always unplug it if not using (even though it cools off) because of the amount of heat made. The nook hd+ runs hot too right where you hold it on the left side in portrait, but not so much when charging. I guess it's better to have it at the plug.", "overall": 3.0, "summary": "This is the oem charger you get with the nook hd+", "unixReviewTime": 1377907200, "reviewTime": "08 31, 2013"}
{"reviewerID": "AGAKHE014LQFU", "asin": "0594481813", "reviewerName": "Nicodimus", "helpful": [3, 5], "reviewText": "Go to Target or Barnes and Noble instead, and pay $25 (which is still a huge markup, considering they make the thing for 50 cents.) This is the worst option if you need one of these. It's price gouging, pure and simple.", "overall": 3.0, "summary": "$45 for a power cord? Good luck with that.", "unixReviewTime": 1379462400, "reviewTime": "09 18, 2013"}
{"reviewerID": "A1S6B5QFWGVL5U", "asin": "0594481813", "reviewerName": "T. Vaughan", "helpful": [2, 2], "reviewText": "Works well, a little pricey I think for a charging cable, but then again, not losing the original would be a lot cheaper than any replacement", "overall": 4.0, "summary": "Good replacement", "unixReviewTime": 1372291200, "reviewTime": "06 27, 2013"}
{"reviewerID": "A20XXTXWF2TCPY", "asin": "0972683275", "helpful": [0, 0], "reviewText": "This is a great buy, compared to a $60 or more a retail store.", "overall": 5.0, "summary": "Excelant mount for Tv. Would buy more if I needed them.", "unixReviewTime": 1405123200, "reviewTime": "07 12, 2014"}
{"reviewerID": "A2IDCSC6NVONIZ", "asin": "0972683275", "reviewerName": "2Cents!", "helpful": [1, 1], "reviewText": "This mount is just what I needed.  It is strong and sturdy.  It folds almost flat to enable the television to sit square and flat against the wall if desired and extends and rotates for angle turns.  A perfect fit as long as you match the correct visa pattern for your television.", "overall": 5.0, "summary": "Perfect", "unixReviewTime": 1367280000, "reviewTime": "04 30, 2013"}
{"reviewerID": "A1EDI0X3GI1SK7", "asin": "0972683275", "reviewerName": "AGW", "helpful": [0, 1], "reviewText": "Great deal, easy to mount and it appears to be fairly sturdy. I mounted a 32 in tv on it and it works great.", "overall": 5.0, "summary": "32 In TV Mount", "unixReviewTime": 1323993600, "reviewTime": "12 16, 2011"}
{"reviewerID": "A3BMUBUC1N77U8", "asin": "0972683275", "reviewerName": "ahoffoss", "helpful": [0, 0], "reviewText": "This mount works really well once you get it up and going.  Only problem is just the arms are a little goofy getting them all in the right spot.  But that's really not too big an issue considering all the different TV's and their mounting hole locations.", "overall": 4.0, "summary": "Pretty simple, but definitely good!", "unixReviewTime": 1385164800, "reviewTime": "11 23, 2013"}
{"reviewerID": "AVRFGGCCCR6QU", "asin": "0972683275", "reviewerName": "Alberto Dieguez \"premiere purchaser of random...", "helpful": [3, 4], "reviewText": "This wall mount does everything it's supposed to do.  The piece that attaches to the wall isn't overly long, which made it easier to mount the arm in the tight space I needed to mount it in.  The only issues I saw was that the joints were VERY tight initially and as we moved the arm around to install it, the joints loosened up to the point where I had to take the included allen wrench and tighten them up again.", "overall": 4.0, "summary": "Fairly good wall mount", "unixReviewTime": 1283126400, "reviewTime": "08 30, 2010"}
{"reviewerID": "A3UOSOCRKS3WIH", "asin": "0972683275", "reviewerName": "Allen Coberly", "helpful": [0, 0], "reviewText": "for the price you just cant beat this item. I bought it for a house I was selling so I could hang some tv and it worked great. Good quality for the price.", "overall": 5.0, "summary": "Cant Beat it!", "unixReviewTime": 1368316800, "reviewTime": "05 12, 2013"}
{"reviewerID": "A371ZZ95ZQEIZV", "asin": "0972683275", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I received the mount, which was well packaged for shipping.  The installation instructions were Moderately clear.  No issues following them, they were just a little disjointed depending on the wall surface you were installing on.My shipment had a mis-cut piece, and was missing 4 screws.  I contacted the Manufacturer, and they shipped me a replacement part and screws the very next day (Shipped out of Texas, so normal mailing times applied)I like how the Mount fits together, and I easily mounted my 60lbs TV by myself.  The part that attaches to the TV has a hook that will hold the TV on the Arm till you bolt it on.It's very adjustable, and pushes almost flush with the wall.I'm very happy, but took one star for the miscut piece.", "overall": 4.0, "summary": "Sturdy Mount, good customer service", "unixReviewTime": 1389052800, "reviewTime": "01 7, 2014"}
